#### Terraform Plan 📖
```
Acquiring state lock. This may take a few moments...
aws_acm_certificate.cloudfront: Refreshing state... [id=arn:aws:acm:us-east-1:079760567374:certificate/e0baf0ab-0cce-4b10-b4c7-17a5a7344e2d]
data.aws_caller_identity.current: Reading...
aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=EM96K1O06AY7Q]
data.aws_ami.amazon_linux_2023: Reading...
aws_vpc.main: Refreshing state... [id=vpc-0075e337704a30cff]
aws_iam_role.ec2_ssm: Refreshing state... [id=care-shift-v3-ec2-ssm]
aws_acm_certificate.alb: Refreshing state... [id=arn:aws:acm:ap-northeast-1:079760567374:certificate/98dcc2b0-50a0-4921-906a-2110705ba31e]
data.aws_caller_identity.current: Read complete after 0s [id=079760567374]
aws_s3_bucket.frontend: Refreshing state... [id=care-shift-v3-frontend-079760567374]
aws_iam_role_policy_attachment.ec2_ssm: Refreshing state... [id=care-shift-v3-ec2-ssm-20260225083115807200000001]
aws_iam_instance_profile.ec2_ssm: Refreshing state... [id=care-shift-v3-ec2-ssm]
data.aws_ami.amazon_linux_2023: Read complete after 2s [id=ami-00633b1b213f5cb4e]
aws_subnet.private_ec2_1c: Refreshing state... [id=subnet-0af1ec33c96958657]
aws_subnet.public_1c: Refreshing state... [id=subnet-0d8695d22adefcc62]
aws_subnet.private_rds_1a: Refreshing state... [id=subnet-007d98cfa8d79482a]
aws_subnet.private_ec2_1a: Refreshing state... [id=subnet-03001749001d5ea4d]
aws_internet_gateway.main: Refreshing state... [id=igw-01250a20da03faa38]
aws_security_group.alb: Refreshing state... [id=sg-0f5a4a1025be8ba3d]
aws_subnet.public_1a: Refreshing state... [id=subnet-09bc82ef4aa70d802]
aws_subnet.private_rds_1c: Refreshing state... [id=subnet-007922faef242b4aa]
aws_lb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:targetgroup/care-shift-v3-tg/943b55fa69d68f89]
aws_route_table.private: Refreshing state... [id=rtb-002667e41ff20336a]
aws_route_table_association.private_ec2_1c: Refreshing state... [id=rtbassoc-016e7795f752550fc]
aws_route_table_association.private_rds_1a: Refreshing state... [id=rtbassoc-0e5d221725c9646cf]
aws_security_group.ec2: Refreshing state... [id=sg-04997652dc2d94873]
aws_route_table.public: Refreshing state... [id=rtb-02adecbdb1bb50434]
aws_route_table_association.private_ec2_1a: Refreshing state... [id=rtbassoc-0ef8390bcd57a934c]
aws_route_table_association.private_rds_1c: Refreshing state... [id=rtbassoc-057ff39173b304667]
aws_db_subnet_group.main: Refreshing state... [id=care-shift-v3-db-subnet-group]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:loadbalancer/app/care-shift-v3-alb/a1484a76bce47e89]
aws_cloudfront_distribution.main: Refreshing state... [id=E1ESAJ6Y0HJ7G0]
aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=care-shift-v3-frontend-079760567374]
aws_security_group.rds: Refreshing state... [id=sg-0cc3e80e9b72381f7]
aws_instance.app: Refreshing state... [id=i-0acc09225dbe74325]
data.aws_iam_policy_document.frontend_s3: Reading...
data.aws_iam_policy_document.frontend_s3: Read complete after 0s [id=44507362]
aws_s3_bucket_policy.frontend: Refreshing state... [id=care-shift-v3-frontend-079760567374]
aws_route_table_association.public_1a: Refreshing state... [id=rtbassoc-02c954ff7eed97388]
aws_route_table_association.public_1c: Refreshing state... [id=rtbassoc-03280963c414b388f]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:listener/app/care-shift-v3-alb/a1484a76bce47e89/6f7e63656ff45855]
aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:listener/app/care-shift-v3-alb/a1484a76bce47e89/96e42fc30fb85787]
aws_db_instance.main: Refreshing state... [id=db-IAMXNR2HMM7K5OBDPROJND4FTM]
aws_lb_target_group_attachment.app: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:targetgroup/care-shift-v3-tg/943b55fa69d68f89-20260225101259749100000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.app must be replaced
-/+ resource "aws_instance" "app" {
      ~ ami                                  = "ami-053d181343d13e2dd" -> "ami-00633b1b213f5cb4e" # forces replacement
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:079760567374:instance/i-0acc09225dbe74325" -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = true -> (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0acc09225dbe74325" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ instance_type                        = "t3.medium" -> "t3.micro"
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-09339ede2ca934f1b" -> (known after apply)
      ~ private_dns                          = "ip-10-0-0-117.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.0.117" -> (known after apply)
      ~ public_dns                           = "ec2-176-34-41-157.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "176.34.41.157" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name" = "care-shift-v3-app"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0ccee6062ac8aa51e" -> (known after apply)
          ~ volume_size           = 2 -> 20
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group_attachment.app must be replaced
-/+ resource "aws_lb_target_group_attachment" "app" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-northeast-1:079760567374:targetgroup/care-shift-v3-tg/943b55fa69d68f89-20260225101259749100000002" -> (known after apply)
      ~ target_id        = "i-0acc09225dbe74325" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```